In [1]:
import pandas as pd 
import numpy as np

In [2]:
df1 = pd.read_csv("cust_dimen.csv")
df1.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [3]:
df2 = pd.read_csv("market_fact.csv")
df2.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.27,0.01,13,4.56,0.93,0.54
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.89,0.09,43,729.34,14.30,0.37
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.15,0.08,35,1219.87,26.30,0.38

In [10]:
df2.sort_values("Prod_id")

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
1593,Ord_1067,Prod_1,SHP_1474,Cust_397,7333.45,0.07,27,-207.28,35.00,0.80
6127,Ord_1791,Prod_1,SHP_2482,Cust_838,416.40,0.02,24,24.33,4.96,0.58
4794,Ord_4923,Prod_1,SHP_6867,Cust_1681,1438.33,0.08,43,163.38,8.22,0.57
2595,Ord_4464,Prod_1,SHP_6219,Cust_1445,279.77,0.07,8,-14.02,8.22,0.57
7772,Ord_3210,Prod_1,SHP_4452,Cust_1183,494.34,0.05,15,-30.19,6.72,0.75
...,...,...,...,...,...,...,...,...,...,...
4693,Ord_2970,Prod_9,SHP_5273,Cust_1326,141.90,0.02,12,1.46,5.72,0.35
7343,Ord_701,Prod_9,SHP_959,Cust_240,355.69,0.09,42,-149.46,8.29,0.38
8134,Ord_2619,Prod_9,SHP_3584,Cust_990,775.77,0.07,20,179.37,9.83,0.40
1669,Ord_5073,Prod_9,SHP_7083,Cust_1720,741.57,0.10,49,352.41,1.39,0.38
8177,Ord_5166,Prod_9,SHP_7220,Cust_1755,347.84,0.00,37,-99.25,8.29,0.38

In [9]:
df2.groupby('Prod_id')[["Prod_id","Order_Quantity"]].sum('Order_Quantity')

         Order_Quantity
Prod_id
Prod_1            13804
Prod_10            4891
Prod_11            9195
Prod_12            7301
Prod_13           16980
Prod_14            2128
Prod_15            9590
Prod_16            3931
Prod_17            7856
Prod_2            10901
Prod_3            22992
Prod_4            22969
Prod_5            20648
Prod_6            30871
Prod_7             4920
Prod_8            19222
Prod_9             6578

In [8]:
df2.groupby('Prod_id')[["Prod_id","Profit"]].sum('Profit')

            Profit
Prod_id
Prod_1     6664.15
Prod_10  -33582.13
Prod_11  -99062.50
Prod_12   13677.17
Prod_13    7564.78
Prod_14  167361.49
Prod_15  149649.73
Prod_16   -7799.25
Prod_17  307712.93
Prod_2    97158.06
Prod_3   307413.39
Prod_4   316951.62
Prod_5   100427.93
Prod_6    45263.20
Prod_7     -102.67
Prod_8    94287.48
Prod_9    48182.60

In [8]:
df2.Sales.dtypes

dtype('float64')

In [7]:
df2.Order_Quantity.dtypes

dtype('int64')

In [9]:
df2.to_csv("market_fact2.csv", index=False)

In [15]:
df2[df2["Cust_id"] == "Cust_1"]

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
5858,Ord_1,Prod_1,SHP_1,Cust_1,261.54,0.04,6,-213.25,35.0,0.8

In [29]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8399 entries, 0 to 8398
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Ord_id               8399 non-null   object
 1   Prod_id              8399 non-null   object
 2   Ship_id              8399 non-null   object
 3   Cust_id              8399 non-null   object
 4   Sales                8399 non-null   float64
 5   Discount             8399 non-null   float64
 6   Order_Quantity       8399 non-null   int64
 7   Profit               8399 non-null   float64
 8   Shipping_Cost        8399 non-null   float64
 9   Product_Base_Margin  8336 non-null   float64
dtypes: float64(5), int64(1), object(4)
memory usage: 656.3+ KB

In [10]:
df3 = pd.read_csv("orders_dimen.csv")
df3.head()

   Order_Date Order_Priority Ord_id
0  13-10-2010            LOW  Ord_1
1  01-10-2012           HIGH  Ord_2
2  10-07-2011           HIGH  Ord_3
3  28-08-2010  NOT SPECIFIED  Ord_4
4  17-06-2011           HIGH  Ord_5

In [16]:
df3[df3.Ord_id == "Ord_293"]

     Order_Date Order_Priority   Ord_id
292  09-12-2009  NOT SPECIFIED  Ord_293

In [19]:
df3.iloc[293]

Order_Date        03-07-2012
Order_Priority      CRITICAL
Ord_id               Ord_294
Name: 293, dtype: object

In [20]:
df3.iloc[483]

Order_Date           10-12-2009
Order_Priority    NOT SPECIFIED
Ord_id                  Ord_484
Name: 483, dtype: object

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5506 entries, 0 to 5505
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Date      5506 non-null   object
 1   Order_Priority  5506 non-null   object
 2   Ord_id          5506 non-null   object
dtypes: object(3)
memory usage: 129.2+ KB

In [5]:
df4 = pd.read_csv("shipping_dimen.csv")
df4.head()

   Order_ID       Ship_Mode   Ship_Date Ship_id
0         3     REGULAR AIR  20-10-2010   SHP_1
1       293  DELIVERY TRUCK  02-10-2012   SHP_2
2       293     REGULAR AIR  03-10-2012   SHP_3
3       483     REGULAR AIR  12-07-2011   SHP_4
4       515     REGULAR AIR  30-08-2010   SHP_5

In [23]:
df4.drop("Order_ID", axis=1, inplace=True) # We dropped Order_ID because it doesn't relate any other

In [25]:
df4.head()

        Ship_Mode   Ship_Date Ship_id
0     REGULAR AIR  20-10-2010   SHP_1
1  DELIVERY TRUCK  02-10-2012   SHP_2
2     REGULAR AIR  03-10-2012   SHP_3
3     REGULAR AIR  12-07-2011   SHP_4
4     REGULAR AIR  30-08-2010   SHP_5

In [27]:
df4.to_csv("shipping_dimen2.csv",index=False)

In [6]:
df5 = pd.read_csv("prod_dimen.csv")
df5.head()

  Product_Category            Product_Sub_Category Prod_id
0  OFFICE SUPPLIES          STORAGE & ORGANIZATION  Prod_1
1  OFFICE SUPPLIES                      APPLIANCES  Prod_2
2  OFFICE SUPPLIES  BINDERS AND BINDER ACCESSORIES  Prod_3
3       TECHNOLOGY    TELEPHONES AND COMMUNICATION  Prod_4
4        FURNITURE              OFFICE FURNISHINGS  Prod_5

In [28]:
df5.to_csv("prod_dimen2.csv", index=False)

In [30]:
df6 = pd.merge(df2, df1, how='inner', on='Cust_id' )
df6

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.8100,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.2700,0.01,13,4.56,0.93,0.54,AARON BERGMAN,ALBERTA,WEST,CORPORATE
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.6900,0.00,26,1148.90,2.50,0.59,AARON BERGMAN,ALBERTA,WEST,CORPORATE
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.8900,0.09,43,729.34,14.30,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.1500,0.08,35,1219.87,26.30,0.38,AARON BERGMAN,ALBERTA,WEST,CORPORATE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8394,Ord_5353,Prod_4,SHP_7479,Cust_1798,2841.4395,0.08,28,374.63,7.69,0.59,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER
8395,Ord_5411,Prod_6,SHP_7555,Cust_1798,127.1600,0.10,20,-74.03,6.92,0.37,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER
8396,Ord_5388,Prod_6,SHP_7524,Cust_1798,243.0500,0.02,39,-70.85,5.35,0.40,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER
8397,Ord_5348,Prod_15,SHP_7469,Cust_1798,3872.8700,0.03,23,565.34,30.00,0.62,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER
8398,Ord_5459,Prod_6,SHP_7628,Cust_1798,603.6900,0.00,47,131.39,4.86,0.38,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER

In [31]:
df7 = pd.merge(df6, df3, how='inner', on='Ord_id')
df7

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Order_Date,Order_Priority
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.8100,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED
1,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.6900,0.00,26,1148.90,2.50,0.59,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED
2,Ord_5446,Prod_6,SHP_7608,Cust_1818,164.0200,0.03,23,-47.64,6.15,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED
3,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.2700,0.01,13,4.56,0.93,0.54,AARON BERGMAN,ALBERTA,WEST,CORPORATE,07-07-2009,HIGH
4,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.8900,0.09,43,729.34,14.30,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE,09-11-2010,MEDIUM
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8394,Ord_5348,Prod_15,SHP_7469,Cust_1798,3872.8700,0.03,23,565.34,30.00,0.62,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,21-08-2011,HIGH
8395,Ord_5353,Prod_4,SHP_7479,Cust_1798,2841.4395,0.08,28,374.63,7.69,0.59,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,29-04-2009,MEDIUM
8396,Ord_5411,Prod_6,SHP_7555,Cust_1798,127.1600,0.10,20,-74.03,6.92,0.37,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,17-09-2010,LOW
8397,Ord_5388,Prod_6,SHP_7524,Cust_1798,243.0500,0.02,39,-70.85,5.35,0.40,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,18-10-2012,CRITICAL
8398,Ord_5459,Prod_6,SHP_7628,Cust_1798,603.6900,0.00,47,131.39,4.86,0.38,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,10-03-2011,MEDIUM

In [32]:
df8 = pd.merge(df7, df4, how='inner', on='Ship_id')
df8

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Order_Date,Order_Priority,Ship_Mode,Ship_Date
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.8100,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED,REGULAR AIR,28-07-2010
1,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.6900,0.00,26,1148.90,2.50,0.59,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED,EXPRESS AIR,27-07-2010
2,Ord_5446,Prod_6,SHP_7608,Cust_1818,164.0200,0.03,23,-47.64,6.15,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED,EXPRESS AIR,28-07-2010
3,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.2700,0.01,13,4.56,0.93,0.54,AARON BERGMAN,ALBERTA,WEST,CORPORATE,07-07-2009,HIGH,EXPRESS AIR,08-07-2009
4,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.8900,0.09,43,729.34,14.30,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE,09-11-2010,MEDIUM,EXPRESS AIR,11-11-2010
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8394,Ord_5348,Prod_15,SHP_7469,Cust_1798,3872.8700,0.03,23,565.34,30.00,0.62,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,21-08-2011,HIGH,DELIVERY TRUCK,23-08-2011
8395,Ord_5353,Prod_4,SHP_7479,Cust_1798,2841.4395,0.08,28,374.63,7.69,0.59,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,29-04-2009,MEDIUM,REGULAR AIR,30-04-2009
8396,Ord_5411,Prod_6,SHP_7555,Cust_1798,127.1600,0.10,20,-74.03,6.92,0.37,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,17-09-2010,LOW,REGULAR AIR,24-09-2010
8397,Ord_5388,Prod_6,SHP_7524,Cust_1798,243.0500,0.02,39,-70.85,5.35,0.40,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,18-10-2012,CRITICAL,REGULAR AIR,21-10-2012
8398,Ord_5459,Prod_6,SHP_7628,Cust_1798,603.6900,0.00,47,131.39,4.86,0.38,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,10-03-2011,MEDIUM,EXPRESS AIR,11-03-2011

In [33]:
df9 = pd.merge(df8, df5, how='inner', on='Prod_id')
df9

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Order_Date,Order_Priority,Ship_Mode,Ship_Date,Product_Category,Product_Sub_Category
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,27-07-2010,NOT SPECIFIED,REGULAR AIR,28-07-2010,OFFICE SUPPLIES,SCISSORS RULERS AND TRIMMERS
1,Ord_2978,Prod_16,SHP_4112,Cust_1088,305.05,0.04,27,23.12,3.37,0.57,AARON HAWKINS,ONTARIO,ONTARIO,HOME OFFICE,24-02-2011,HIGH,REGULAR AIR,26-02-2011,OFFICE SUPPLIES,SCISSORS RULERS AND TRIMMERS
2,Ord_5484,Prod_16,SHP_7663,Cust_1820,322.82,0.05,35,-17.58,3.98,0.56,ADRIAN SHAMI,ALBERTA,WEST,CONSUMER,26-02-2012,LOW,REGULAR AIR,03-03-2012,OFFICE SUPPLIES,SCISSORS RULERS AND TRIMMERS
3,Ord_3730,Prod_16,SHP_5175,Cust_1314,459.08,0.04,34,61.57,3.14,0.60,ALEKSANDRA GANNAWAY,SASKACHEWAN,PRARIE,CORPORATE,07-12-2009,MEDIUM,EXPRESS AIR,09-12-2009,OFFICE SUPPLIES,SCISSORS RULERS AND TRIMMERS
4,Ord_4143,Prod_16,SHP_5771,Cust_1417,207.21,0.06,24,-78.64,6.14,0.59,ALLEN ARMOLD,NEW BRUNSWICK,ATLANTIC,HOME OFFICE,09-10-2009,CRITICAL,REGULAR AIR,10-10-2009,OFFICE SUPPLIES,SCISSORS RULERS AND TRIMMERS
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8394,Ord_5467,Prod_14,SHP_7639,Cust_1803,5964.19,0.10,33,988.20,24.49,0.46,TONJA TURNELL,ALBERTA,WEST,CONSUMER,10-07-2011,NOT SPECIFIED,REGULAR AIR,12-07-2011,TECHNOLOGY,COPIERS AND FAX
8395,Ord_825,Prod_14,SHP_1132,Cust_247,27663.92,0.05,8,-391.92,24.49,0.37,TONY CHAPMAN,BRITISH COLUMBIA,WEST,CONSUMER,10-01-2011,CRITICAL,REGULAR AIR,12-01-2011,TECHNOLOGY,COPIERS AND FAX
8396,Ord_5368,Prod_14,SHP_7497,Cust_1795,17279.62,0.04,40,4176.25,24.49,0.52,TONY SAYRE,ALBERTA,WEST,SMALL BUSINESS,01-07-2009,LOW,REGULAR AIR,05-07-2009,TECHNOLOGY,COPIERS AND FAX
8397,Ord_1765,Prod_14,SHP_2446,Cust_595,14647.26,0.07,25,5485.15,24.49,0.37,VICTORIA WILSON,ONTARIO,ONTARIO,HOME OFFICE,17-06-2010,LOW,REGULAR AIR,26-06-2010,TECHNOLOGY,COPIERS AND FAX
8398,Ord_3610,Prod_14,SHP_4998,Cust_1266,1759.65,0.06,3,-2213.75,24.49,0.50,WILLIAM BROWN,SASKACHEWAN,PRARIE,CORPORATE,23-03-2009,NOT SPECIFIED,REGULAR AIR,24-03-2009,TECHNOLOGY,COPIERS AND FAX

In [36]:
df9.to_csv("All_dimen.csv", index=False) # All dimension merged

In [40]:
df9.to_excel("All_dimen.xlsx")